---
kind: property
id: P:Autodesk.Revit.DB.MEPSystem.HasFabricationParts
zh: 系统
source: html/1d649db3-79da-5cf7-5224-1dd689240afa.htm
---
# Autodesk.Revit.DB.MEPSystem.HasFabricationParts Property

**中文**: 系统

Indicates if the system has one or more fabrication parts.

## Syntax (C#)
```csharp
public bool HasFabricationParts { get; }
```